//#include<iostream>
//using namespace std;
//int main(void)
//{
//
//	cout << "Hello World!" << endl;
//	/*
//	
//	C++的基础内容部分与C语言基本相同，但是由的内容会在形式上有所不同，在学习上主要学习C++与C的不同之处
//
//		数据类型：
//			基本数据类型：
//				此部分内容与C语言完全相同
//				此处略去
//			构造类型：
//				>数组
//				>结构体
//				>联合
//				>枚举
//				此部分内容与C语言完全相同
//			指针：
//				与C语言内容类似，但是使用的关键词不相同
//				>C++：new、delete
//				>C：malloc、free
//			引用：
//				C++新内容
//
//		运算符：
//			优先级
//			结合性
//				此部分内容与C语言完全相同
//
//		流程结构：
//			顺序：
//				此部分内容与C语言完全相同
//			循环：
//				C++增强for循环
//				与C语言不相同
//			分支跳转：
//				此部分内容与C语言完全相同
//			Goto：
//				不论是C还是C++，goto能不用就别用
//
//			函数：
//				声明与定义
//				函数类型
//				函数指针
//				函数重载：
//					C++新内容
//				参数缺省值：
//					C++新内容
//				递归函数
//
//			文件操作：
//				此部分内容与C语言完全相同
//
//			内存管理：
//				此部分内容与C语言完全相同
//				但是由于存在类，因此有所不同
//
//			类型修饰符：
//				Static与Const的新功能
//
//			预处理：
//				C++全新预防重复包含的方法：#pragma once
//
//	
//	*/
//	return 0;
//}